#include <iostream>
using namespace std;
int main()
{
    int a[10][10] = {{1, 0, 0, 0, 0, 0, 0, 0, 0, 0},  //1
                    {1, 0, 0, 1, 1, 1, 1, 0, 0, 0},  //2
                    {1, 0, 0, 0, 0, 0, 0, 0, 0, 0},  //3
                    {0, 0, 1, 0, 0, 0, 0, 0, 0, 0},  //4
                    {0, 0, 1, 0, 0, 0, 0, 1, 1, 1},  //5
                    {0, 0, 0, 0, 1, 0, 0, 0, 0, 0},  //6
                    {1, 1, 0, 0, 0, 0, 0, 1, 0, 1},  //7
                    {0, 0, 0, 1, 0, 0, 0, 0, 0, 0},  //8
                    {1, 1, 0, 0, 0, 0, 0, 0, 0, 0},  //9
                    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0}}; //10
        
                    
    int x, y;
    int pol = 0, vis = 0; //проверка остались еще палубы
    
    cout << "Морской бой"<< endl;
    
    
    
    cout << "  "; //строки 10 на 10
    for(int i = 0; i<10; i++){
        cout << i << " ";
    }
    cout << endl;
    
    for(int i = 0; i<10; i++){
        cout << i << " ";
        
        for(int j = 0; j<10; j++){ //процесс присвоения состояния коробля или его отсутствия на поле
            if(a[i][j] == 0 or a[i][j] == 1)
                cout << "  ";
            else if(a[i][j] == 2)
                cout << "+ ";
            else if(a[i][j] == 3)
                cout << ". ";
        }
        cout << endl;
    }
    for (int i = 0; i< 10; i++){  //количество палуб на поле
        for(int j=0; j<10; j++){
            if (a[i][j] == 1){
                pol += 1;
            }
        }
    }
    
    while(pol != 0){  // пока есть палубы , то кол-во выстрелов +1. проверка, когда наступит победа
        vis += 1;
        cout << endl<< "Введите координаты выстрела"<< endl;
        
        
        cout << "Введите строку от 0-9"<< endl; //ввод координаты
        cin >> x;
        cout << "Введите столбец от 0-9"<< endl;
        cin >> y;
        
        
        
        
        if(a[x][y] == 1){
            a[x][y] = 2;
            pol = pol - 1;
        }
        else if(a[x][y] == 0){
            a[x][y] = 3;
        }
        else if(a[x][y]!= 1 || a[x][y]!= 0){
            cout <<"Ой! Эта координата уже была использованна. Напишите координаты повторно";
        }
        
        
        cout << endl<< "Поле противника"<< endl;
        cout << "  "; //строки 10 на 10 после выстелов пользователя
        for(int i = 0; i<10; i++){
            cout << i << " ";
        }
        cout << endl;
        
        for(int i = 0; i<10; i++){
            cout << i << " ";
        
            for(int j = 0; j<10; j++){ //процесс присвоения состояния палубы или его отсутствия на поле
                if(a[i][j] == 0 or a[i][j] == 1)
                    cout << "  ";
                else if(a[i][j] == 2)
                    cout << "+ ";
                else if(a[i][j] == 3)
                    cout << ". ";
            }
            cout << endl;
        }
        
        system("cls");
        //проверка выстрела. если выстрел на координату, 
        
    }
    
    
    
   
    
    if(pol == 0)
        cout << "Количество выстрелов, за которое вы побили все корабли "<< vis;
    
    
    
   
                       
    return 0;
}
